{
  "success": true,
  "data": [
    {
      "id": "1",
      "title": "一个完整的家就这样给毁了",
      "desc": " <p>历时半年，终于在确凿的出轨证据中，坚定地离婚！</p><p>一堆堆的证据呈现眼前，电话记录、微信记录、转账记录，原来自己像个傻子一样给骗了三年多。当我在为家庭奔波赚钱的时候，当我一个瘦瘦的身影背着孩子上五楼看医生的时候，当我在家拼死拼活照顾孩子的时候，当我的父亲离世的时候，当我奶奶离开的时候……原来这个所谓的丈夫却在跟别的女人翻云覆雨，不管你死活。</p><p>他还大条道理说个个男人都这样，真是恬不知耻。世上出轨的男人很多，但忠诚的男人也不少，为何就要去做出轨的一份子呢？虽然分隔两地，但我一直都觉得他的人不是这样坏的，原来是我自己太天真罢了！有的人本身就坏到骨子里，只是表面看不出，因为表里不一。只是自己不懂，也是因为自己太相信对方罢了！已经超出底线，踏破原则了，那也没什么好说的。</p><p>他巴不得赶紧离婚，这样他就解脱了，他觉得自己所犯的罪就消失了，觉得自己以后也自由了。</p><p>可我呢？我都是阴影，我还要受到他过去对我造成的伤害的折磨；我的孩子呢？没办法在一个完整的家庭中成长……他带给我和孩子的伤害能因为离婚磨灭吗？能因为离婚就能消失吗？我和孩子就能开心吗？</p><p>这种人渣迟早天会收他的，报应会来的，只是迟早的问题。正如他出轨这么多年，天网恢恢，绝对会有识破的一天，他做过的坏事，总会得到该有的惩罚的！天是公平的！不可能做了那么多坏事，伤害了这么多人，还会逍遥自在的！只是时辰未到而已！我也放长双眼，好好去看……我已经很累了，不想再继续了……我实在没有那么大气，实在没有办法去接受那么恶心的人，实在只想拿把刀刺死他，都没法解除我心里的恨………</p><p>一个完整的家就这样给他毁了……</p>"
    },
    {
      "id": "2",
      "title": "第一次开房的经历",
      "desc": "<p>老王家空调取暖器坏了，加上他又感冒，这段时间，他都在外面开房睡，今天忽悠我出来玩。结果太冷了，又钻进了酒店，我有些害怕，虽然是男女朋友，可是毕竟在酒店里…结果老王毫不客气教我女子防身术，理论教完了实战，让我勒住他的脖子，结果人家漂亮的一个过肩摔，我懵逼了，在天上旋转一跳跃我闭着眼，360度直接摔倒了床上，疼到不是很疼，我被老王的直男懵逼了，真摔？？？来来来，我示范完了你试试，这次换我勒住你脖子，结果我使出吃奶的劲，过肩摔？不可能，老王纹丝不动，来了句，我要发力了。嘭，我又被过肩摔了…</p><p>说不出的感觉，虽然摔得不疼，但是还是昏昏沉沉的，开房难道就干这事，我是来挨揍的吗？可是别人似乎又是好心教我防身术，而且情侣开房也并没有占我便宜，我…一言难尽。</p><p>被老王摔了一个上午，终于累了，你们要的小黄文还是没有，对，没有啪啪啪，没有亲亲抱抱举高高，我们非常和谐的玩起了二人麻将？直到老王的妈给他打电话喊他买手机，老王带着我出门了。</p><p>本以为直接跟着他妈一起买手机，结果，老王在街角直接甩了我，一个人走了，让我自由活动，我？？？不愿意带我见父母，真棒，冷战吧，不谢</p><p>最后，想看小黄文没看到气急败坏的，请私聊评论里的小哥哥，让他们给一些黄se网站，别激动，别开口骂人，大冬天的，别鸡冻（狗头狗头）</p>"
    },
    {
      "id": "3",
      "title": "自从掌握了软件开发的 5 条核心原则，我每天工作时至少可以多摸鱼 4 个小时",
      "desc": "<h2>原则一： Don't Repeat Yourself。<h2><p>直译叫做“不要重复你自己”，还有另外一个耳熟能详的版本，“不要重复造轮子”。在你一开始进入软件开发这个领域后，就一定要注意，把你自己写过的一些解决方案汇总到一起，定期梳理一遍，写点文档，不断重构，使它们成为一把把瑞士军刀。如果可以的话，把它们开源出来，服务更多的开发者。有了自己的工具库后，当你下次遇到类似的需求时，就可以直接拿出来用，省去不少时间。除此之外，你还应该善于利用那些业界已经开源出来的成熟的技术方案，比如下面这些。</p><p>GitHub 和码云是两个充满宝藏的地方，如果你觉得自己的能力还不到自己造轮子的份上，那就一定要多上上这两个网站，里面有很多成熟的解决方案供你免费使用。</p><p>比如说，你要一套商城系统，那么 marcozheng 的 mall 就可以直接拿来作为原型。比如说，你要一套人事管理系统，那么江南一点雨的 vhr 就可以直接拿来作为原型。（虽然推荐了很多次，但好朋友的，多推荐一次不嫌多。）</p><h2>原则二： Keep it simple stupid。<h2><p>著名的 KISS 原则，即“保持简单、保持愚蠢”，和史蒂夫·乔布斯的名言“stay hungry, stay foolish”有着异曲同工之妙。</p><p>从苹果产品的设计上也可以体现出来这个原则，起初的手机，比如说诺基亚智能机，带很多实体键，但苹果只有一个 home 键，其他全部虚拟键代替，彻底革了诺基亚的命。</p><p>在我们设计软件的过程中，千万不要想得太复杂，越简单越好，等成型了以后再丰富效果，否则开发成本会变得很昂贵，软件就可以腹死胎中。</p><h2>原则三： You Ain't Gonna Need It。</h2><p>英文直译为“你不需要它”，该规则要求程序员在必要之前不应该添加功能。极限编程的联合创始人罗恩·杰弗里斯（Ron Jeffries）曾经说过：“总是在实际需要时才实现事物，而不是在预见到需要它们时才实现。”</p><p>项目负责人（产品经理）更应该坚持这条原则，千万不要过度拆解用户的需求，在产品设计的过程追加过多自己认为应该追加的功能，因为在一个软件使用中，往往 80% 的请求都花费在 20% 的功能上。</p><p>很多次要的功能可能需要，因为它们的存在而使软件锦上添花，但没有它们，软件的商业价值依然是存在的。功能越少，开发周期就会越短，这样就更有可能打败竞品。</p><h2>原则四： Done is better than perfect。</h2><p>Done is better than perfect because perfect is never done。很简单的一句英文，能理解吧？不要总想着把所有的功能做完善，做完美后再上线，应该在产品具有一定的雏形后就立即上线试错，根据用户的反馈，根据市场的需求再去考量是否追加一些其他的功能或者优化。“人无完人，金无足赤”，应该允许一些瑕疵存在，刻意追求完美并不见得是一件好事。乔布斯想要一整块屏幕，但技术达不到的时候，他也是会留一个 home 键的。</p><p>我们程序员在开发软件的时候，也应该遵循这条原则，先把功能做出来再说，至于效果，用户的体验，应该往后放，不要总想着尽善尽美，尽善尽美意味着永远也完不成——没有最好，只有更好。</p><h2>原则五： Choose the most suitable things。</h2><p>选择最适合的，不要盲目追求时髦。技术日新月异，应接不暇，如果在开发软件的时候，一味追求最前沿的技术，可能就会让产品变成小白鼠。</p><p>就好像我们谈一场恋爱，不要一味去追求高不可攀的，往往那些在我们身边的，肯陪伴我们的才是最好的。技术选型的时候，适合就好。如果产品的目标用户只有一千人不到，就没必要搞分布式，搞大数据，否则就有点“蛇吞象”的意味；等真到了需要搞分布式，搞大数据的时候再升级完全来得及。</p>"
    }
  ]
}
